In [4]:
import numpy as np

In [24]:
rand = np.random.RandomState(101)
data = np.arange(12).reshape(3,4)

In [25]:
data.shape

(3, 4)

In [31]:
data

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [39]:
data[:]

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [40]:
import pandas as pd

In [41]:
series = pd.Series([0.25,0.5,0.75,1.0],index=['a','b','c','d'])
series

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [47]:
series['c']

0.75

In [48]:
series.keys

<bound method Series.keys of a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64>

In [53]:
list(series.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [54]:
series['e']=1.25

In [56]:
series['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [57]:
series[1:3]

b    0.50
c    0.75
dtype: float64

In [61]:
series.loc['a']

0.25

In [62]:
series.loc['a':'d']

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [63]:
series.iloc[1]

0.5

In [64]:
series.iloc[1:3]

b    0.50
c    0.75
dtype: float64

In [65]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})

pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})

dataframe = pd.DataFrame({'area':area,'pop':pop})

In [71]:
dataframe['pop']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
Name: pop, dtype: int64

In [72]:
dataframe['density'] = dataframe['pop']/dataframe['area']
dataframe

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [73]:
dataframe.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [74]:
dataframe.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [75]:
dataframe.iloc[:3,:2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [77]:
dataframe.loc[:'New York',:'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [79]:
dataframe.loc[dataframe.density>100,['pop','density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [80]:
#it will add another column name (0,2)
dataframe[0,2]=90

In [ ]:
# we drop that unwanted column and inplace it.
dataframe.drop(columns=[(0,2)],inplace=True)

In [89]:
#now this is what I really want to do
dataframe.iloc[0,2]=90

In [91]:
ser =  pd.Series(rand.randint(0,10,4))
ser

0    8
1    4
2    8
3    5
dtype: int64

In [92]:
df = pd.DataFrame(rand.randint(0,10,(3,4)),columns=['a','b','c','d'])
df

   a  b  c  d
0  0  5  8  1
1  3  8  3  3
2  2  8  9  3

In [93]:
np.exp(ser)

0    2980.957987
1      54.598150
2    2980.957987
3     148.413159
dtype: float64

In [94]:
np.sin(df * np.pi/4)

          a             b             c         d
0  0.000000 -7.071068e-01 -2.449294e-16  0.707107
1  0.707107 -2.449294e-16  7.071068e-01  0.707107
2  1.000000 -2.449294e-16  7.071068e-01  0.707107

In [95]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [96]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [100]:
population.index | area.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [101]:
population.index & area.index

Index(['California', 'Texas'], dtype='object')

In [102]:
A = pd.Series([2,3,4],index=[0,1,2])
B = pd.Series([3,4,5],index=[1,2,3])
A + B

0    NaN
1    6.0
2    8.0
3    NaN
dtype: float64

In [105]:
A.add(B,fill_value=0)

0    2.0
1    6.0
2    8.0
3    5.0
dtype: float64

In [107]:
A = pd.DataFrame(rand.randint(0,10,(2,2)),columns=list('AB'))
A

   A  B
0  9  8
1  4  3

In [108]:
B = pd.DataFrame(rand.randint(0,20,(3,3)),columns=list('BAC'))
B

   B   A   C
0  3   7  10
1  7   6  14
2  9  18   7

In [110]:
A + B

      A     B   C
0  16.0  11.0 NaN
1  10.0  10.0 NaN
2   NaN   NaN NaN

In [112]:
#filling the mean value of A
# First stacking row of A and then get the mean of it.
fill =  A.stack().mean()
# Apply this fill in fill_values
A.add(B,fill_value=fill)

      A     B     C
0  16.0  11.0  16.0
1  10.0  10.0  20.0
2  24.0  15.0  13.0

In [114]:
A = rand.randint(10,size=(3,4))
A

array([[3, 7, 4, 8],
       [6, 3, 7, 6],
       [5, 6, 9, 2]])

In [115]:
df =  pd.DataFrame(A,columns=list('QRST'))
df

   Q  R  S  T
0  3  7  4  8
1  6  3  7  6
2  5  6  9  2

In [116]:
#Row-wise subtraction
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1  3 -4  3 -2
2  2 -1  5 -6

In [117]:
#Column-wise substraction
df.subtract(df['R'],axis=0)

   Q  R  S  T
0 -4  0 -3  1
1  3  0  4  3
2 -1  0  3 -4

In [118]:
halfrow = df.iloc[0,::2]
halfrow

Q    3
S    4
Name: 0, dtype: int64

In [119]:
df -  halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1  3.0 NaN  3.0 NaN
2  2.0 NaN  5.0 NaN